[LANG]
language=繁体中文 (中国香港/澳门)
[FONT]
font-name=Microsoft Yahei UI
welcome-text-size=64
home-text-size=24
home-section-size=26
analysis-text-size=22
analysis-section-size=24
left-panel-size=18
panel-list-size=18
panel-list-label-size=22
panel-list-header-size=18
panel-list-item-size=15
panel-button-size=14
combobox-size=18
list-combobox-size=18
checkbox-size=16
radio-size=17
elem-size=12
image-button-size=16
form-text-size=17
list-text-size=18
search-edit-size=18
message-text-size=18
setting-button-size=14
process-text-size=16
properites-title-font=20
properites-section-font=18
log-list-item-text-size=14
log-list-item-sql-size=16
[ERROR]
000000=
200001=SQL 語法錯誤
200002=檔案不存在
200003=檔案損毀
200004=參數錯誤
200026=資料表名稱已重複
200027=資料表名稱不存在
200028=匯入 CSV 檔案錯誤，未能生成 SQL，請檢查 CSV 檔案內容和設定項是否正確
300001=未選取建立索引的資料表欄位
300002=SQL 陳述式不能為空
300003=SQL 分析僅支援 SELECT 查詢陳述式
[STRING]
home=首頁
database=資料庫
analysis=分析
view=視圖
setting=設定
items=筆記錄
tables=資料表
views=視圖
triggers=觸發器
columns=欄位
indexes=索引
table=資料表
clear-all=全部清除
yes=確定
no=取消
welcome-text=歡迎來到 CuteSqlite
home-text1=CuteSqlite 是 Sqlite3 的圖形用戶介面（GUI）工具。
home-text2=它允許您設計、建立和瀏覽資料庫、處理資料庫對象，
home-text3=和插入數據以及設計和運行 SQL 查詢以處理存儲的數據。
home-text4=您還可以將資料庫和數據從其他資料庫供應商遷移到 Sqlite 資料庫。
db-section-text=Sqlite 資料庫
analysis-text1=CuteSqlite 允許您分析和優化 SQL 陳述式的性能。
analysis-text2=而且允許您分析資料庫每張表的存儲容量，
analysis-text3=以及設定資料庫的參數，來優化資料庫。
perf-analysis-section-text=性能分析
error-text=系統錯誤：
create-database=新增一個資料庫 (Ctrl+N)
open-database=開啟一個資料庫 (Ctrl+O)
refresh-database=重新整理資料庫 (F5)
delete-database=移除清單中選取資料庫 (Del)
override-user-db=檔案的數據刪除後無法找回，確定是否覆蓋資料庫？
create-db-success-text=資料庫建立成功
open-db-exists-inlist=資料庫已開啟，請勿重複操作
open-db-success-text=資料庫開啟成功
delete-user-db=確定從清單中移除選取的資料庫 "{dbName}"？
delete-db-success-text=從清單中移除資料庫成功
query-editor=查詢編輯器
history=歷史記錄
history-tip=歷史記錄 (F8)
result-list=結果
result-info=信息
result-table-data=資料表數據
table-properties=資料表屬性
exec-select-sql=執行當前選取的查詢 (F9)
exec-all-sql=執行所有查詢 (F10)
explain-select-sql=Explain 當前選取的 SQL 陳述式 (F11)
explain-query-plan-sql=Explain query plan 當前選取的 SQL 陳述式 (F12)
query-page-help=自動完成功能：[Tab]->下一個標籤；[Ctrl+Space]->列出匹配的標籤；[Ctrl+Enter]->列出所有的標籤
no-select-userdb=未選擇資料庫
no-sql-statement=查詢編輯器未輸入 SQL 陳述式
no-sql-content=查詢編輯器無 SQL 陳述式
show-form-view=顯示表單視圖
export-result-as=導出為... (Ctrl+Alt+E)
copy-result-data=複製數據到剪貼板
clear-all=全部清除
ok=確定
cancel=取消
export-text-description=選擇導出數據的格式
csv-settings=csv 選項
csv-field-settings=欄位
csv-line-settings=行
csv-charset-settings=編碼
excel-settings=Excel 選項
sql-settings=SQL 選項
export-fields-settings=選擇要導出的欄位
terminated-by=分隔符
enclosed-by=包含符
escaped-by=轉義符
field-terminated-by=欄位分隔符
field-enclosed-by=欄位包含符
field-escaped-by=欄位轉義符
line-terminated-by=換行符
add-column-name=头部添加欄位名
csv-charset=編碼
excel-column-max-size=文本列大小限制
excel-decinmal-places=小數位
structure-only=僅表結構
data-only=僅數據
structure-and-data=表結構和數據
select-all=全選
deselect-all=全不選
save-to-file=導出到文件
expert-fmt-error=請選擇數據導出的文件格式
terminated-by-error=請輸入的「終止於」的值
enclosed-by-error=請輸入「包含在」的值
escaped-by-error=請輸入「轉義符」的值
line-terminated-by-error=行的「終止於」的值不正確
excel-column-max-size-error=請輸入「文本列大小限制」的值
excel-decinmal-places-error=請輸入「小數位」的值
export-sql-error=請選擇 SQL 選項
selected-fields-error=請選擇導出的欄位
export-path-error=請輸入導出文件的路徑
sql-notsupport-multitable-query-error=不支持多表查詢和子查詢的結果導出
export-success-text=導出成功，已導出{rows}行數據，是否打開文件？
open-the-file=打開文件
export-file-exists-prompt={export-path} 已存在，是否替換？
limit-rows=限制行
offset=開始行
rows=行數
copy-all-rows-to-clipboard=複製所有行到剪貼板	Ctrl+Alt+A
copy-sel-rows-to-clipboard=複製選中行到剪貼板	Ctrl+Alt+H
copy-all-rows-as-sql=所有行複製為 SQL	Ctrl+Alt+J
copy-sel-rows-as-sql=選中行複製為 SQL	Ctrl+Alt+K
read-only=只讀
filter=篩選器 (Ctrl+Alt+F)
filter-in-use=篩選器使用中
refresh=重新整理 (Ctrl+F5)
refresh-page=重新整理
new-row-tip=新建一行 (Ctrl+Alt+N)
copy-row-tip=複製一行 (Ctrl+Alt+C)
save-tip=保存 (Ctrl+Alt+S)
delete-tip=刪除選中行 (Ctrl+Del)
cancel-tip=撤銷更改 (Ctrl+Alt+Z)
revert-tip=恢復
save=保存
revert=撤銷更改
column=欄位名
condition=條件
value=值
delete-confirm-text=確定刪除所選行？
query=查詢
result=結果
affected-rows=影響行數
exec-time=執行耗時
transfer-time=傳送耗時
total-time=總耗時
database-create=新建資料庫		Ctrl+N
database-open=打開資料庫		Ctrl+O
database-refresh=重新整理資料庫		Ctrl+R
database-delete=刪除資料庫		Del
database-copy=複製資料庫為...	Ctrl+P
database-export-as-sql=導出資料庫到 SQL	Ctrl+E
database-import-from-sql=導入 SQL 到資料庫	Ctrl+I
database-new=創建
database-new-table=表
database-new-view=視圖
database-new-trigger=觸發器
export-as-sql-text-description=以 SQL 的方式導出選中資料庫的表/視圖/觸發器
select-database=選中的資料庫
database-objects=對象
structure-and-data-settings=結構和數據設置
insert-statement-settings=INSERT 語句設置
tbl-statement-settings=數據表語句設置
retain-column-text=在「Insert Into」中保留欄位名
contain-multi-rows-text=每條「Insert」語句包含多行 (VALUES)
retain-table-text=保留舊表 (Create Table If Not Exists ...)
override-table-text=覆蓋舊表 (DROP TABLE, 然後 CREATE TABLE)
import-from-sql-text-description=批量執行在 SQL 文件中的語句。
abort-on-error-text=出錯時終止。
import-file-not-exists=導入的 SQL 文件不存在，請重新選擇。
import-path-empty-error=導入的文件路徑不能為空。
import=導入
export=導出
tbl-name=表名
new-table=創建表
new-view=創建視圖
new-trigger=創建觸發器
database=資料庫
schema=Schema
table-columns=欄位
table-indexes=索引
table-foreignkeys=外鍵
column-name=欄位名
data-type=數據類型
default=默认
check=檢查
index-name=索引名
index-type=索引類型
index-unique=Unique
partial-clause=部分子句
comments=注釋
to-be-selected=待選的欄位
selected=已選的欄位
up=▲
down=▼
no-columns-selected=未選擇欄位，請選擇
sql-preview=SQL 預覽
tbl-name-empty=表名不能為空
tbl-name-duplicated=表名已重複
create-table-success-text=表創建成功。
alter-table-success-text=表修改成功。
rename-table-success-text=表名修改成功。
delete-column-confirm-text=所選欄位由一個或多個索引引用。刪除此列還將修改相應的索引。確定繼續刪除嗎？
delete-index-confirm-text=所選索引由一個或多個欄位引用。刪除此索引還將修改相應的欄位。確定繼續刪除嗎？
delete-confirm-text=確定繼續刪除嗎？
new-view=創建視圖
new-trigger=創建觸發器
create-a-view-name=新視圖名稱
view-name-not-empty=新視圖名稱不能為空
view-name-duplicated=視圖名稱已重複
create-a-trigger-name=觸發器名稱
trigger-name-not-empty=觸發器名稱不能為空
trigger-name-duplicated=觸發器名稱已重複
execute-sql-success=SQL 執行成功
copy-db-success-text=資料庫複製成功
table-open=打開表數據		Alt+O
table-create=創建表		Alt+N
table-alter=修改表		Alt+A
table-rename=重命名表		Alt+M
table-truncate=清空表		Alt+T
table-drop=刪除表		Alt+Del
table-copy-as=複製表到...		Alt+P
table-sharding-as=分片		Alt+G
table-export=導出表到...	Alt+E
table-import-sql=從 SQL 文件導入	Alt+I
table-import-csv=從 CSV 文件導入	Alt+J
table-manage-index=管理表索引
table-manage-foreign-key=管理表外鍵
properties=屬性
primary-key-duplicated=主鍵 (Primary key) 重複定義。
foreignkey-name=外鍵名
referencing-columns=本表欄位
referenced-table=外聯表
referenced-columns=外聯欄位
on-update=On Update
on-delete=On Delete
insert-new-column=添加新欄位
insert-new-index=添加新索引
insert-new-foreignkey=添加新外鍵
insert-del-column=刪除選中欄位
insert-del-index=刪除選中索引
insert-del-foreignkey=刪除選中外鍵
select-referenced-table-first=請先選擇外聯表
new-table-name=新表名
table-name-not-empty=新表名不能為空
table-name-duplicated=新表名已重複
ai-column-exists=自增欄位 (AUTOINCREMENT) 已存在。
ai-fobidden-multi-pk=已有自增欄位 (AUTOINCREMENT)，不允許多個主鍵欄位。
ai-column-must-integer=自增欄位 (AUTOINCREMENT) 必須為 INTEGER 整數類型。
truncate-table-confirm-text=清空表後，數據不可恢復，確定清空嗎？
truncate-table-success-text=成功清空數據表
drop-table-confirm-text=刪除數據表後，數據不可恢復，確定刪除嗎？
drop-table-success-text=成功刪除數據表
copy-table-text-description=配置複製參數，支持數據表分片
from-db-name=源資料庫
from-tbl-name=源表
to-db-name=目標資料庫
to-tbl-name=目標表
table-sharding-setttings=數據表分片
enable-table-sharding=啟用數據表分片
table-suffix-begin={suffix} 開始整數
table-suffix-end={suffix} 結束整數
advanced-settings=表分片高級選項
enable-copy-data-with-strategy=啟用策略，將數據複製到分片表
sharding-strategy-express-text=分表策略表達式：{n}
preview-sql=預覽 SQL 語句
structure-and-data-settings-unknown=結構和數據設置未選擇
table-suffix-error=分片整數無效，請填寫正確的值
target-table-name-no-n=目標表必須包含字符串 "{n}".
sharding-strategy-express-empty=分表策略表達式不能為空
copy-table-success-text=表複製成功。
start=開始
complete=完成
express-title=表分片策略表達式
functions=函數
express-editor-help=表達式 - 雙擊函數或欄位，插入到編輯器
import-from-csv-text-description=從 CSV 文件導入數據的配置項
source-csv-file=源 CSV 文件路徑
target-database=目標資料庫
target-table=目標表
columns-setttings=欄位
csv-data=CSV 數據
column-name-on-top=第一行作為欄位名
line-terminated-by=換行符
csv-null-as-keyword=null/NULL 作為 SQL 關鍵字
encoding=Encoding
import-success-text=導入成功
incorrect-sql-statement=錯誤的 SQL 語句
import-error-text=導入錯誤
table-manage-columns=管理欄位
table-drop-column=刪除欄位
table-manage-indexes=管理索引
table-drop-index=刪除索引
create-view=創建新視圖
open-view=打開視圖
drop-view=刪除視圖
create-trigger=創建觸發器
open-trigger=打開觸發器
drop-trigger=刪除觸發器
drop-view-confirm-text=刪除視圖後，視圖不可恢復，確定刪除嗎？
drop-view-success-text=成功刪除視圖
drop-trigger-confirm-text=刪除觸發器後，觸發器不可恢復，確定刪除嗎？
drop-trigger-success-text=成功刪除觸發器
sql-templates=SQL 語句模板
pragma-templates=Pragmas
sql-log=SQL 歷史記錄
clear-all=全部清除
use=使用
explain=Explain
top=置頂
untop=取消置頂
copy=複製
delete=刪除
today=今天
yestoday=昨天
delete-sql-log-confirm-text=你確定要刪除 SQL 日誌嗎？
copy-to-clipboard=已複製到剪貼板
save-success-text=保存成功
delete-success-text=刪除成功
data-has-changed=數據已更改，您確定要關閉頁面嗎？
not-save-and-close=不保存，關閉
cancel=取消關閉
table-export-as=導出數據表	Alt+E
export-as-sql-success-text=導出成功，是否打開文件？
new-query=新建查詢窗口 (F7)
save-current=保存當前 (Ctrl+S)
save-all=保存所有 (Ctrl+Shift+S)
first-page=首頁
prev-page=上一頁
next-page=下一頁
last-page=末頁
save-if-data-has-changed=數據已更改，確定先保存嗎？
unsort=取消排序
tab-close-this=關閉
tab-close-others=關閉非當前
tab-close-left=關閉左邊所有
tab-close-right=關閉右邊所有
perf-analysis=性能分析
perf-analysis-reports=分析報告
store-analysis=存儲分析
db-params=資料庫參數
not-select-sql=僅支持 SELECT 語句
open-sql-log=打開 SQL 日誌進行性能分析 (Ctrl+L)
add-sql-analysis=輸入 SQL 語句進行性能分析 (Ctrl+I)
sql-log-not-found=未找到 SQL 日誌，請檢查是否已刪除
original-sql=原始的 SQL 語句
where-clause-analysis=WHERE 子句分析
order-clause-analysis=ORDER 子句分析
covering-index-analysis=覆蓋索引分析
table-join-analysis=Joins 分析
in-table=數據表
where-use-column=WHERE 語句使用了欄位
order-use-column=ORDER 語句使用了欄位
covering-index-column=WHERE 和 ORDER 語句使用了欄位
where-use-index=WHERE 語句使用了索引
order-use-index=ORDER 語句使用了索引
use-covering-index=使用了覆蓋索引
create-index-for-performance=建議：為以下欄位創建索引，能提升查詢性能
hint-index-for-performance=提示：索引{hintIndexName} 已覆蓋包含的欄位：{hintIndexColumns}
create-covering-index-for-performance=建議：為以下欄位創建覆蓋索引，能提升查詢性能
create-index-togeger=創建索引
create-index-individ=單獨創建索引
create-covering-index=創建覆蓋索引
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=下面的偽代碼展示查詢優化器的執行過程
cycle-count=循環統計
optimize-cycle-count=提示：更改 JOIN 表不同的順序，可以優化減少循環次數。
general-settings=通用設置
about=關於
language-setting=界面語言設置
change-language-restart-text=更改語言，必須重啟本軟件才生效。
close-and-restart=關閉重啟
do-not-restart=不重啟
about-us=關於我們
about-us-description=CuteSqlite 由作者 Xuehan Qin 開發一款開源軟件。
version-info=版本
version-info-description=CuteSqlite v0.2.2 beta (64 位)
feedback=Feedback
feedback-description=If you have software issues, or have ideas and suggestions for this application, please fill out the form below to feedback us.
content-text=Content
license=Apache License Version 2.0
select-columns-analysis=Select 欄位分析
select-use-column=Select 語句使用了以下欄位
select-use-column-count=欄位數
select-use-column-advice=建議：SELECT 語句選擇的欄位超過了{maxColumns} 個，盡量減少欄位，能提升查詢性能。
select-use-column-tips=提示：盡量減少欄位，能提升查詢性能。
sql-perf-report-prefix=sql-perf-report-
store-analysis-prefix=存儲分析：
analysis-sql=SQL 分析
open-perf-report=打開報告		Alt+O
drop-perf-report=刪除報告		Alt+Del
drop-perf-report-confirm-text=確定刪除報告嗎？
store-analysis-text=允許您分析資料庫，數據表，表索引的存儲容量
table-store-analysis=表 - {tblName}
index-store-analysis=索引 - {idxName} - 所屬表:{tblName}
db-disk-used-title=磁盤空間利用率報告，DB 路徑:{dbPath}
page-size-text=頁大小 (單位：字節)
page-size-tips=頁大小 (單位：字節)
file-bytes-text=文件大小 (單位：字節)
file-bytes-tips=文件大小 (單位：字節)
file-pgcnt-text=整個文件中的頁數 (測量值)
file-pgcnt-tips=整個文件中的頁數 (測量值)
file-pgcnt2-text=整個文件中的頁數 (計算值)
file-pgcnt2-tips=整個文件中的頁數 (計算值)
inuse-pgcnt-text=存儲數據的頁數 (已用)
inuse-pgcnt-tips=存儲數據的頁數 (已用)
free-pgcnt2-text=未存儲數據的頁數 (每個头部)
free-pgcnt2-tips=未存儲數據的頁數 (每個头部)
free-pgcnt-text=未存儲數據的頁數 (計算值)
free-pgcnt-tips=未存儲數據的頁數 (計算值)
av-pgcnt-text=自動清空的頁數
av-pgcnt-tips=自動清空的頁數
ntable-text=資料庫中的表數
ntable-tips=資料庫中的表數
nindex-text=索引數
nindex-tips=索引數
nmanindex-text=定義索引數
nmanindex-tips=定義索引數
nautoindex-text=隐含索引數 (自增索引)
nautoindex-tips=隐含索引數 (自增索引)
user-payload-text=用戶有效負載存儲的字節數
user-payload-tips=用戶有效負載存儲的字節數
all-tbl-entrycnt-title=所有表數據量 (條數)
all-tbl-idx-pagecnt-title=所有表及其索引的頁數
sperate-tbl-idx-pagecnt-title=所有表和索引的頁數分別計算
all-tbl-idx-report-title=所有表格和索引
total-pages-percent-text=佔資料庫總數的百分比
total-pages-percent-tips=佔資料庫總數的百分比
nentry-text=數據量 (條數)
nentry-tips=數據量 (條數)
storage-text=消耗的存儲字節數
storage-tips=消耗的存儲字節數
compressed-size-text=壓縮後使用的字節數
compressed-size-tips=壓縮後使用的字節數
payload-text=有效負載的字節數
payload-tips=有效負載的字節數
total-meta-text=元數據的字節數
total-meta-tips=元數據的字節數
depth-text=B 樹深度
depth-tips=B 樹深度
avg-payload-text=每條數據的平均有效載荷
avg-payload-tips=每條數據的平均有效載荷
avg-unused-text=每條數據的平均未使用字節數
avg-unused-tips=每條數據的平均未使用字節數
avg-meta-text=每條數據的平均元數據
avg-meta-tips=每條數據的平均元數據
avg-fanout-text=平均 fanout 數
avg-fanout-tips=平均 fanout 數
gap-cnt-text=非連續頁面
gap-cnt-tips=非連續頁面
mx-payload-text=每條數據的最大有效載荷
mx-payload-tips=每條數據的最大有效載荷
ovfl-cnt-text=已使用的溢出數據條數
ovfl-cnt-tips=已使用的溢出數據條數
int-pages-text=已使用的索引頁數
int-pages-tips=已使用的索引頁數
leaf-pages-text=已使用的主頁數
leaf-pages-tips=已使用的主頁數
ovfl-pages-text=已使用的溢出頁數
ovfl-pages-tips=已使用的溢出頁數
total-pages-text=已使用的總頁數
total-pages-tips=已使用的總頁數
int-unused-text=索引頁上未使用的字節數
int-unused-tips=索引頁上未使用的字節數
leaf-unused-text=主頁上未使用的字節數
leaf-unused-tips=主頁上未使用的字節數
ovfl-unused-text=溢出頁上未使用的字節數
ovfl-unused-tips=溢出頁上未使用的字節數
total-unused-text=所有頁上未使用的字節數
total-unused-tips=所有頁上未使用的字節數
all-table-report-title=所有表 (排除索引)
all-indices-report-title=所有索引 (排除表)
tbl-and-all-idx-report-title=表 {tblName} 及其所有索引
tbl-only-report-title=表 {tblName} 排除任何索引
idx-only-report-title=表 {tblName} 的所有索引
tbl-report-title=表 {tblName}
idx-report-title=表 {tblName} 的索引 {idxName}
props-tbl-only-report-title=表 {tblName} 存儲分析
props-idx-props-only-report-title=表 {tblName} 的所有索引
db-pragma-params=PRAGMA 參數
db-quick-config-params=快捷配置方案
select-pragma=PRAGMA
pragma-analysis-limit-tips=查詢或更改近似分析 (ANALYZE) 設置的限制。這是分析 (ANALYZE) 命令在每個索引中檢查的大致行數。
pragma-application-id-tips=用於查詢或設定位於偏移量 68 處的 32 位有號大端「Applicatioin ID」整數到資料庫頭中。
pragma-auto-vacuum-tips=在資料庫中查詢或設置自動清空狀態。
pragma-automatic-index-tips=查詢、設置或清除自動索引功能。
pragma-busy-timeout-tips=查詢或更改忙碌超時 (busy timeout) 的設置。
pragma-cache-size-tips=查詢或更改每個打開的資料庫文件一次在內存中保留的 SQLite 建議的最大資料庫磁盤頁數。
pragma-cache-spill-tips=啟用或禁用分頁程序在事務中間將髒緩存頁溢出到資料庫文件的功能。
pragma-case-sensitive-like-tips=LIKE 運算符的默認行為是忽略 ASCII 字符的大小寫。因此，默認情況下，'a' LIKE 'A' 為 true。
pragma-cell-size-check-tips=在最初從磁盤讀取資料庫 B 樹頁面時，啟用或禁用其他健全性檢查。啟用單元格大小檢查後，可以更早地檢測到資料庫損壞，並且不太可能「擴散 (Spread)」。
pragma-checkpoint-fullfsync-tips=查詢或更改檢查點操作的 fullfsync 標記。如果設置了此標誌，則在支持 F_FULLFSYNC 的系統上執行檢查點操作期間將使用 F_FULLFSYNC 同步方法。CHECKPOINT_FULLFSYNC 標誌的默認值為 OFF。只有 Mac OS-X 支持 F_FULLFSYNC。
pragma-collation-list-tips=返回為當前資料庫連接定義的歸類序列的列表。
pragma-compile-options-tips=返回構建 SQLite 時使用的編譯時選項的名稱，每行一個選項。
pragma-count-changes-tips=查詢或更改計數更改標誌。通常，當未設置 count-changes 標誌時，INSERT、UPDATE 和 DELETE 語句不返回數據。
pragma-data-store-directory-tips=查詢或更改 sqlite3_data_directory 全局變量的值，Windows 操作系統界面後端使用該變量來確定存儲使用相對路徑名指定的資料庫文件的位置。
pragma-data-version-tips=指示資料庫文件已被修改。在內存中保存資料庫內容或在屏幕上顯示資料庫內容交互程序可以使用 PRADMA data_version 命令來確定它們是否需要刷新和重新加載內存或更新屏幕顯示。
pragma-default-cache-size-tips=查詢或設置將為每個打開的資料庫文件分配的建議最大磁盤緩存頁數。
pragma-defer-foreign-keys-tips=指示所有外鍵約束延遲到提交最外層的事務。
pragma-empty-result-callbacks-tips=查詢或更改空結果回調標誌。
pragma-encoding-tips=主資料庫使用的文本編碼，'UTF-8'、'UTF-16le'(小端 UTF-16 編碼) 或'UTF-16be'(大端 UTF-16 編碼) 之一。
pragma-foreign-key-check-tips=檢查資料庫或表是否有違反外鍵約束的情況
pragma-foreign-keys-tips=查詢、設置或清除外鍵約束的實施。
pragma-freelist-count-tips=返回資料庫文件中未使用的頁數。
pragma-full-column-names-tips=查詢或更改 full_column_names 標誌。
pragma-fullfsync-tips=查詢或更改 fullfsync 標誌。此標誌確定是否在支持 F_FULLFSYNC 同步方法的系統上使用該方法。Fullfsync 標誌的缺省值為 OFF。只有 Mac OS X 支持 F_FULLFSYNC。
pragma-hard-heap-limit-tips=對單個進程中所有資料庫連接的堆內存量施加限制。
pragma-ignore-check-constraints-tips=啟用或禁用檢查約束的強制。默認設置為 OFF，這意味著默認情況下強制執行檢查約束。
pragma-incremental-vacuum-tips=導致最多 N 個頁面從自由列表中刪除。
pragma-integrity-check-tips=對資料庫執行低級格式化和一致性檢查。
pragma-journal-mode-tips=查詢或設置與當前資料庫連接關聯的資料庫的日記模式。
pragma-journal-size-limit-tips=限制事務或檢查點之後保留在文件系統中的回滾日誌和 WAL 文件的大小。
pragma-legacy-alter-table-tips=設置或查詢 legacy_alter_table 標誌的值。
pragma-locking-mode-tips=設置或查詢資料庫連接鎖定模式。鎖定模式為正常模式 (NORMAL) 或獨佔模式 (EXCLUSIVE)。
pragma-max-page-count-tips=查詢或設置資料庫文件中的最大頁數。
pragma-mmap-size-tips=查詢或更改為單個資料庫上的內存映射 I/O(memory-mapped I/O) 保留的最大字節數。
pragma-module-list-tips=返回向資料庫連接註冊的虛擬表模塊的列表。
pragma-optimize-tips=嘗試優化資料庫。
pragma-page-count-tips=返回資料庫文件中的總頁數。
pragma-page-size-tips=查詢或設置資料庫的頁面大小。頁面大小必須是介於 512% 和 65536 之間的 2 的幂。
pragma-parser-trace-tips=打開對 SQLite 內部使用的 SQL 解析器的跟蹤。使用 SQLITE_DEBUG 編譯時生效。
pragma-query-only-tips=防止資料庫文件上的數據更改。當啟用此項時，任何 CREATE、REPORT、DROP、REPORT 或 UPDATE 嘗試都將導致 SQLITE_READONLY 錯誤。
pragma-quick-check-tips=對資料庫執行低級格式設置和一致性檢查，跳過 UNIQUE 和索引一致性檢查。
pragma-read-uncommitted-tips=查詢、設置或清除 READ UNCOMMITTED 隔離。
pragma-recursive-triggers-tips=查詢、設置或清除觸發器的遞歸功能。
pragma-reverse-unordered-selects-tips=啟用時，該 PRAGMA 會導致許多沒有 ORDER BY 子句的 SELECT 語句以與通常相反的順序發出結果。
pragma-schema-version-tips=獲取或設置資料庫頭中偏移量 40 處的 chema-versio 整數值。
pragma-secure-delete-tips=查詢或更改安全刪除 (secure-delete) 設置。
pragma-short-column-names-tips=查詢或更改短欄位名標誌。
pragma-soft-heap-limit-tips=對單個進程中的所有資料庫連接，限制佔用的堆內存量。
pragma-stats-tips=返回有關表和索引的輔助信息。
pragma-synchronous-tips=查詢或更改「同步 (synchronous)」標誌的設置。
pragma-temp-store-tips=查詢或更改 sqlite3_temp_directory 全局變量的值，許多操作系統界面後端使用該變量來確定在何處存儲臨時表和索引。
pragma-threads-tips=預準備語句 (prepared statement) 啟動協助查詢的輔助線程數。
pragma-trusted-schema-tips=是否允許在 schema 中運行未經安全審核的 SQL 函數和虛擬表。確定是否允許視圖、觸發器或架構表達式（如 CHECK 約束、DEFAULT 子句、生成的欄位、表達式索引和/或部分索引）運行未經安全審核的 SQL 函數和虛擬表。
pragma-user-version-tips=獲取或設置資料庫頭中偏移量 60 處的 user-version 整數值
pragma-vdbe-addoptrace-tips=完整的 VDBE 操作碼在代碼生成期間創建時顯示出來。前提是 SQLite 以 SQLITE_DEBUG 選項編譯和 vdbe_debug 開啟。
pragma-vdbe-debug-tips=開啟 VDBE 調試，前提是 SQLite 以 SQLITE_DEBUG 選項編譯
pragma-vdbe-listing-tips=在標準輸出上顯示完整的虛擬機操作碼列表。前提是 SQLite 以 SQLITE_DEBUG 選項編譯和 vdbe_debug 開啟。
pragma-vdbe-trace-tips=在計算時在標準輸出上打印虛擬機操作碼。前提是 SQLite 以 SQLITE_DEBUG 選項編譯和 vdbe_debug 開啟。
pragma-wal-autocheckpoint-tips=查詢或設置預寫日誌 (write-ahead log)/auto-checkpoint 間隔。
pragma-wal-checkpoint-tips=導致資料庫連接 D 上的資料庫 X 的預寫日誌 (write-ahead log) 中的內容被傳輸到資料庫文件中，並重置預寫日誌 (write-ahead log)。
pragma-writable-schema-tips=可以使用普通的 UPDATE、INSERT 和 DELETE 語句更改 sqlite_schema 表。警告：濫用此編譯指示很容易導致資料庫文件損壞。
pragma-save-confirm=PRAGMA 語句會影響資料庫運行，確定執行下面的語句嗎？
confirm-exec-text=確定&執行